""" Напишите программу, которая будет преобразовывать десятичное число в двоичное (без встроенных функций).

Пример:

- 45 -> 101101
- 3 -> 11
- 2 -> 10 """

# number = 45
# temp = 0
# res = ''
#
# while number > 0:
#     temp = str(number % 2)
#     res = res + temp
#     number = int(number/2)
# print(res)

